app/views/notes/_note.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" IN ($1, $2)  [["id", 1], ["id", 3]]
---
<% else %>
    <% note_authors = notes.includes(:user) %>