app/controllers/albums_controller.rb

SELECT "bands".* FROM "bands"
---
  def new
    @album = Album.new(band_id: params[:band_id])
    @bands = Band.all

SELECT "bands".* FROM "bands"
INSERT INTO "albums" ("band_id", "title", "year", "studio", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["band_id", 4], ["title", "Sleepy Time"], ["year", 2000], ["studio", false], ["created_at", "2019-05-10 23:32:29.513353"], ["updated_at", "2019-05-10 23:32:29.513353"]]
---
  def create
    @album = Album.new(album_params)
    @bands = Band.all

    if @album.save

SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "tracks".* FROM "tracks" WHERE "tracks"."album_id" = $1 ORDER BY "tracks"."ord" ASC  [["album_id", 1]]
---
  def show
    @album = Album.find_by_id(params[:id])
    @band = @album.band
    @tracks = @album.tracks.order(:ord)

SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
SELECT "bands".* FROM "bands"
---
  def edit
    @album = Album.find_by_id(params[:id])
    @bands = Band.all

SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT "bands".* FROM "bands"
UPDATE "albums" SET "year" = $1, "studio" = $2, "updated_at" = $3 WHERE "albums"."id" = $4  [["year", 5000], ["studio", true], ["updated_at", "2019-05-09 04:07:25.826058"], ["id", 4]]
---
  def update
    @album = Album.find_by_id(params[:id])
    @bands = Band.all

    if @album.update_attributes(album_params)

SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
DELETE FROM "albums" WHERE "albums"."id" = $1  [["id", 4]]
---
  def destroy
    album = Album.find_by_id(params[:id])
    band = album.band

    if album
      album.destroy