app/controllers/application_controller.rb

  def current_user
    @user = User.find_by_session_token(session[:session_token])
---
SELECT  "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "ZaMcVs/aD68qxoPknQNo6A=="], ["LIMIT", 1]]