app/controllers/bands_controller.rb

SELECT "bands".* FROM "bands" ORDER BY "bands"."name" ASC
---
  def index
    @bands = Band.all.order(:name)

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
  def edit
    @band = Band.find_by_id(params[:id])

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "bands" SET "name" = $1, "updated_at" = $2 WHERE "bands"."id" = $3  [["name", "Radioheads"], ["updated_at", "2019-05-08 07:03:57.075400"], ["id", 2]]
---
  def update
    @band = Band.find_by_id(params[:id])

    if @band.update_attributes(band_params)

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
SELECT "albums".* FROM "albums" WHERE "albums"."band_id" = $1 ORDER BY "albums"."title" ASC  [["band_id", 1]]
---
  def show
    @band = Band.find_by_id(params[:id])
    @albums = @band.albums.order(:title)

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "bands" WHERE "bands"."id" = $1  [["id", 3]]
---
  def destroy
    band = Band.find_by_id(params[:id])

    if band
      band.destroy