app/controllers/notes_controller.rb

INSERT INTO "notes" ("user_id", "track_id", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 1], ["track_id", 1], ["body", "Embedded form note"], ["created_at", "2019-05-09 23:32:00.388977"], ["updated_at", "2019-05-09 23:32:00.388977"]]
---
  def create
    note = Note.new(note_params)
    note.user_id = current_user.id
    note.track_id = params[:id]

    flash[:error] = 'Unable to save note, please try again' unless note.save

SELECT  "notes".* FROM "notes" WHERE "notes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "notes" WHERE "notes"."id" = $1  [["id", 1]]
---
  def destroy
    note = Note.find_by_id(params[:id])
    if note
      note.destroy