app/controllers/search_controller.rb

  def index
    @query = params[:query]
    query = "%#{@query.upcase}%"

    @bands = Band.where('UPPER(name) LIKE ?', query)
    @albums = Album.where('UPPER(title) LIKE ?', query)
    @tracks = Track.where('UPPER(title) LIKE ? OR UPPER(lyrics) LIKE ?', query, query)
---
SELECT  "bands".* FROM "bands" WHERE (UPPER(name) LIKE 'TEST') LIMIT $1  [["LIMIT", 11]]
SELECT  "albums".* FROM "albums" WHERE (UPPER(title) LIKE 'TEST') LIMIT $1  [["LIMIT", 11]]
SELECT  "tracks".* FROM "tracks" WHERE (UPPER(title) LIKE 'TEST' OR UPPER(lyrics) LIKE 'TEST') LIMIT $1  [["LIMIT", 11]]