app/controllers/tracks_controller.rb

SELECT "albums".* FROM "albums"
---
  def new
    @track = Track.new(album_id: params[:album_id])
    @albums = Album.all

SELECT "albums".* FROM "albums"
INSERT INTO "tracks" ("album_id", "title", "ord", "lyrics", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["album_id", 1], ["title", "Body Memory"], ["ord", 6], ["lyrics", ""], ["created_at", "2019-05-09 05:32:33.087533"], ["updated_at", "2019-05-09 05:32:33.087533"]]
---
  def create
    @track = Track.new(track_params)
    @albums = Album.all

    if @track.save

SELECT  "tracks".* FROM "tracks" WHERE "tracks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "albums".* FROM "albums"
---
  def edit
    @track = Track.find_by_id(params[:id])
    @albums = Album.all

SELECT  "tracks".* FROM "tracks" WHERE "tracks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "tracks" SET "lyrics" = $1, "updated_at" = $2 WHERE "tracks"."id" = $3  [["lyrics", "This is a test"], ["updated_at", "2019-05-09 05:42:44.836243"], ["id", 1]]
---
  def update
    @track = Track.find_by_id(params[:id])
    @albums = Album.all

    if @track.update_attributes(track_params)

SELECT  "tracks".* FROM "tracks" WHERE "tracks"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
  def show
    @track = Track.find_by_id(params[:id])

SELECT  "tracks".* FROM "tracks" WHERE "tracks"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
DELETE FROM "tracks" WHERE "tracks"."id" = $1  [["id", 4]]
---
  def destroy
    track = Track.find_by_id(params[:id])
    album = track.album

    if track
      track.destroy