app/controllers/users_controller.rb

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "EDrJ3vYsY-0ydnGQBUPKHg"], ["updated_at", "2019-05-08 02:31:15.636959"], ["id", 2]]
---
  def create
    @user = User.create(user_params)

    if @user.save