app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    if @user.save
---
INSERT INTO "users" ("email", "password_digest", "session_token", "created_at", "updated_at", "activation_token") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def activate
    user = User.find_by_activation_token(params[:activation_token])

    if user
      user.activated = true
      user.save
---
SELECT  "users".* FROM "users" WHERE "users"."activation_token" = $1 LIMIT $2  [["activation_token", "ZTGo5h6PX2703b2bYqMm6g"], ["LIMIT", 1]]
UPDATE "users" SET "activated" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["activated", true], ["updated_at", "2019-05-10 05:26:07.230805"], ["id", 5]]